In [ ]:
"""
Este archivo es para manipular los datos que se ha bajado Alba de los menus de los restaurantes y posteriormente pasarselos a Marta.
Se utilizan los datos del archivo csv api_chueca4
"""

In [1]:
import json
import requests
import pandas as pd
import random 
import numpy as np 
from pandas.io.json import json_normalize
from sklearn.preprocessing import LabelEncoder

In [2]:
menu_1 = pd.read_csv('api_chueca4.csv', index_col=0)

In [3]:
menu_1.head(3)

,restaurante,seccion,platos,precios,platos_lower,seccion_lower,Categorias
0,7 Delicatessen,Entrante,Ensalada de queso de cabra con naranja agria a...,"8,5",ensalada de queso de cabra con naranja agria a...,entrante,Ensalada
1,7 Delicatessen,Entrante,Tortilla de patata con cebolla caramelizada,8,tortilla de patata con cebolla caramelizada,entrante,Entrantes
2,7 Delicatessen,Entrante,Ensalada de foie y cebolla caramelizada,"8,5",ensalada de foie y cebolla caramelizada,entrante,Ensalada

In [5]:
menu_1.Categorias.value_counts()

None            296
Postres         130
Entrantes       126
Pescado          72
Carne            36
Ensalada         32
Hamburguesa      28
Marisco          23
Pasta            22
Arroces          16
Pollo            14
Pizza             7
De la huerta      3
Name: Categorias, dtype: int64

In [4]:
# Cambio el indice por uno nuevo y que sea de valores únicos y consecutivos.
menu_1.reset_index(drop=True, inplace=True)
menu_1.head(6)

,restaurante,seccion,platos,precios,platos_lower,seccion_lower,Categorias
0,7 Delicatessen,Entrante,Ensalada de queso de cabra con naranja agria a...,"8,5",ensalada de queso de cabra con naranja agria a...,entrante,Ensalada
1,7 Delicatessen,Entrante,Tortilla de patata con cebolla caramelizada,8,tortilla de patata con cebolla caramelizada,entrante,Entrantes
2,7 Delicatessen,Entrante,Ensalada de foie y cebolla caramelizada,"8,5",ensalada de foie y cebolla caramelizada,entrante,Ensalada
3,7 Delicatessen,Plato,Pollo yakitori,8,pollo yakitori,plato,Pollo
4,7 Delicatessen,Plato,Pizza de gambón y chile confitado,"8,5",pizza de gambón y chile confitado,plato,Pizza
5,7 Delicatessen,Plato,Rissoto de boletus,9,rissoto de boletus,plato,None

In [7]:
menu_1.seccion.value_counts().tail(10)

Tacos para los que no comen carne    2
Para seguir comiendo...              2
Sopas                                2
POSTRES CASEROS                      2
Golosos de la trastienda             1
Servicio                             1
*Reserva de 1 hora y media*          1
Mesas                                1
Especiallidad maldeamores            1
Aperitivo                            1
Name: seccion, dtype: int64

In [5]:
# Doy categoria a estos  platos que no habian sido categorizados 

menu_1['Categorias'][menu_1.index == 5] = "Arroces"
menu_1['Categorias'][menu_1.index == 51] = "De la huerta"
menu_1['Categorias'][menu_1.index == 91] = "De la huerta"
menu_1['Categorias'][menu_1.index == 66] = "Pescado"
menu_1['Categorias'][menu_1.index ==201] = "Carne"
menu_1['Categorias'][menu_1.index ==308] = "Pescado"
menu_1['Categorias'][menu_1.index ==318] = "Pescado"
menu_1['Categorias'][menu_1.index ==319] = "Pescado"
menu_1['Categorias'][menu_1.index ==320] = "Pescado"
menu_1['Categorias'][menu_1.index ==322] = "Pescado"
menu_1['Categorias'][menu_1.index ==323] = "Pescado"
menu_1['Categorias'][menu_1.index ==324] = "Pescado"
menu_1['Categorias'][menu_1.index ==429] = "Carne"
menu_1['Categorias'][menu_1.index ==396] = "Marisco"
menu_1['Categorias'][menu_1.index ==393] = "Pescado"
menu_1['Categorias'][menu_1.index ==403] = "Pescado"
menu_1['Categorias'][menu_1.index ==404] = "Pescado"
menu_1['Categorias'][menu_1.index == 744] = "De la huerta"
menu_1['Categorias'][menu_1.index == 745] = "De la huerta"
menu_1['Categorias'][menu_1.index ==667] = "Marisco"
menu_1['Categorias'][menu_1.index ==670] = "Marisco"
menu_1['Categorias'][menu_1.index ==665] = "Pescado"
menu_1['Categorias'][menu_1.index ==666] = "Pescado"
menu_1['Categorias'][menu_1.index == 668] = "De la huerta"
menu_1['Categorias'][menu_1.index ==708] = "Carne"
menu_1['Categorias'][menu_1.index ==711] = "Carne"
menu_1['Categorias'][menu_1.index ==714] = "Carne"

In [6]:
# Mediante mascaras elimino del df lo que no me interese
mask1 = (menu_1['seccion'] == 'seccion_bebidas')
mask2 = (menu_1['seccion']== 'Aperitivo')
mask3 = (menu_1['seccion']== '*Reserva de 1 hora y media*')
mask4 = (menu_1['seccion']== 'Servicio')
#mask5 = (menu_chueca['seccion']== 'Golosos de la trastienda')
mask6 = (menu_1['seccion']== 'Mesas')
#mask7 = (menu_chueca['seccion']== 'POSTRES CASEROS')
#mask8 = (menu_chueca['seccion']== 'Tacos para los que no comen carne')
mask9 = (menu_1['restaurante']== 'TE CATO') # Sin precios
mask10 = (menu_1['restaurante']== 'Vides') # Sin precios
mask11 = (menu_1['Categorias']== 'None')

In [7]:
menu = menu_1[~((mask1) | (mask2) | (mask3) | (mask4) |(mask6) |(mask9) | (mask10) | (mask11)) ]

In [8]:
menu.head (2)

,restaurante,seccion,platos,precios,platos_lower,seccion_lower,Categorias
0,7 Delicatessen,Entrante,Ensalada de queso de cabra con naranja agria a...,"8,5",ensalada de queso de cabra con naranja agria a...,entrante,Ensalada
1,7 Delicatessen,Entrante,Tortilla de patata con cebolla caramelizada,8,tortilla de patata con cebolla caramelizada,entrante,Entrantes

In [9]:
# Cambio el indice para que sean valores consecutivos tras eliminar algunos de los registros.
menu.reset_index(drop=True, inplace=True)

In [10]:
# Añado nueva columna llamada restaurantsID con los nombres de los restaurantes y posteriormente la Codifico mediante LabelEncoder.
menu['restaurantsID'] = menu['restaurante']

le = LabelEncoder()
menu["restaurantsID"] = le.fit_transform(menu["restaurantsID"])
menu.tail()

,restaurante,seccion,platos,precios,platos_lower,seccion_lower,Categorias,restaurantsID
511,tuk tuk,Plato,"Ternera al curry con verduras, anacardos, arro...",18,"ternera al curry con verduras, anacardos, arro...",plato,Carne,25
512,tuk tuk,Plato,Teriyaki de salmón servido con arroz de jazmín...,18,teriyaki de salmón servido con arroz de jazmín...,plato,Pescado,25
513,tuk tuk,Postre,"Plátano asado, envuelto en azúcar de caña, fru...","6,5","plátano asado, envuelto en azúcar de caña, fru...",postre,Postres,25
514,tuk tuk,Postre,Fruta de temporada servida con sorbete de menta,"6,5",fruta de temporada servida con sorbete de menta,postre,Postres,25
515,tuk tuk,Postre,Carpaccio de piña aderezado con menta y sorbet...,"6,5",carpaccio de piña aderezado con menta y sorbet...,postre,Postres,25

In [11]:
# Genero las puntuaciones de los platos.
import numpy as np
test = np.random.uniform(3, 4.8, size=516)
test = np.around(test,1)
test = list(test)
#test

In [12]:
menu['ranking'] = test

In [13]:
# Reemplazo la coma por el punto y lo convierto a float
def euros_a_numero(euros):
    try:
        return float(euros.replace(" €", "").replace(",","."))
    except:
        return None;

In [14]:
menu["precios"] = menu["precios"].apply(euros_a_numero)
menu.head()

,restaurante,seccion,platos,precios,platos_lower,seccion_lower,Categorias,restaurantsID,ranking
0,7 Delicatessen,Entrante,Ensalada de queso de cabra con naranja agria a...,8.5,ensalada de queso de cabra con naranja agria a...,entrante,Ensalada,0,4.1
1,7 Delicatessen,Entrante,Tortilla de patata con cebolla caramelizada,8.0,tortilla de patata con cebolla caramelizada,entrante,Entrantes,0,3.7
2,7 Delicatessen,Entrante,Ensalada de foie y cebolla caramelizada,8.5,ensalada de foie y cebolla caramelizada,entrante,Ensalada,0,4.5
3,7 Delicatessen,Plato,Pollo yakitori,8.0,pollo yakitori,plato,Pollo,0,3.8
4,7 Delicatessen,Plato,Pizza de gambón y chile confitado,8.5,pizza de gambón y chile confitado,plato,Pizza,0,3.1

In [50]:
# Creo nueva columna para rangeprice y la categorizo en tres niveles
menu["rangeprice"] = menu["precios"]
menu.rangeprice= menu.rangeprice.apply(lambda x: '1' if x < 9.0 else '2' if( x >= 7.0 and x <= 15 )else '3')

In [51]:
# Reorganizo el df quedandome solo con las columnas que son útiles.

menu_4 = menu[['Categorias','platos','precios', 'rangeprice','ranking','restaurantsID']]

In [52]:
menu_4.rename(columns={'Categorias': 'style', 'platos': 'name', 'precios': 'price'}, inplace=True)

In [53]:
menu_4.head()

,style,name,price,rangeprice,ranking,restaurantsID
0,Ensalada,Ensalada de queso de cabra con naranja agria a...,8.5,1,4.1,0
1,Entrantes,Tortilla de patata con cebolla caramelizada,8.0,1,3.7,0
2,Ensalada,Ensalada de foie y cebolla caramelizada,8.5,1,4.5,0
3,Pollo,Pollo yakitori,8.0,1,3.8,0
4,Pizza,Pizza de gambón y chile confitado,8.5,1,3.1,0

In [54]:
menu_4.rangeprice.value_counts()

1    214
2    188
3    114
Name: rangeprice, dtype: int64

In [55]:
# Convierto el df a json y lo guardo
json_menu =menu_4.to_json(orient='records')
parsed = json.loads(json_menu)
with open('json_menu.json', 'w+') as outfile:
    json.dump(parsed, outfile, indent=4)

## Ahora el df para la localización de los restaurantes

In [58]:
restaurants = pd.read_json("rest_Chueca.json")
restaurants.head()

,Restaurant,Style,Address,latitude,lomgitude
0,Kuoco 360,Restaurants,"[Calle San Bartolmé, 14, 28004 Madrid Madrid, ...",40.421842,-3.698456
1,Bunny's Deli,Vegetarian / Vegan Restaurants,"[Calle San Gregorio 17, 28004 Madrid Madrid, E...",40.423935,-3.697158
2,Pizzaiolo,Italian Restaurants,"[C. Hortaleza, 84, 28004 Madrid Madrid, España]",40.423795,-3.698597
3,Vides,Gastropubs,"[C. Libertad, 12, 28004 Madrid Madrid, España]",40.421017,-3.697354
4,Food Truck,American Restaurants,"[C. San Lucas, 11, Madrid Madrid, España]",40.423816,-3.696086

In [59]:
lista_restaurants = list(menu.restaurante.unique())
len(lista_restaurants)

26

In [56]:
lista_restaurants

['7 Delicatessen',
 'Aloha Poké',
 'Bagatella',
 'Bazaar',
 'Boho Bar',
 'Bosco de Lobos',
 'Dionisos',
 'Food Truck',
 'Gioia Restaurante',
 'Hamburguesa Nostra',
 'Hot Now',
 'Izakaya Han',
 'Kuoco 360',
 'La Carmencita',
 'La Trastienda',
 'le cocó',
 'Mal de Amores',
 'Morgana',
 'Restaurante Arce',
 'RESTAURANTE KRITIKOS',
 'Roostiq',
 'San Wich',
 'Sr. Ito',
 'Taberna El Buo',
 'Tepic',
 'tuk tuk']

In [60]:
rest_json =restaurants[restaurants['Restaurant'].isin(lista_restaurants)]
rest_json.head()

,Restaurant,Style,Address,latitude,lomgitude
0,Kuoco 360,Restaurants,"[Calle San Bartolmé, 14, 28004 Madrid Madrid, ...",40.421842,-3.698456
4,Food Truck,American Restaurants,"[C. San Lucas, 11, Madrid Madrid, España]",40.423816,-3.696086
5,Hot Now,Pizza Places,"[barbieri 14, 28004 Madrid Madrid, España]",40.421317,-3.698030
6,Izakaya Han,Japanese Restaurants,"[San Bartolome 10 (Augusto Figueroa), 28004 Ma...",40.421819,-3.698475
8,Sr. Ito,Sushi Restaurants,"[Calle Pelayo 60, Madrid Madrid, España]",40.424194,-3.697464

In [61]:
rest_json["restaurantsID"] = le.fit_transform(rest_json["Restaurant"]) # Codifico restaurantes para obtener el ID
rest_json.sort_values(by='restaurantsID', inplace=True) # Ordeno df en orden ascendente en funcion del restauransID
rest_json.reset_index(drop=True, inplace=True) # Sustituyo indice para que aparezcan valores contiguos y crecientes
rest_json['telephone'] =  random.sample(range(91153000, 91175026), 26)  # Añado telefonos
#rest_json.drop(['Style'], axis='columns', inplace=True)
rest_json.rename(columns={'Restaurant': 'restaurants', 'Address': 'address'}, inplace=True)

In [62]:
rest_json.head()

,restaurants,Style,address,latitude,lomgitude,restaurantsID,telephone
0,7 Delicatessen,Spanish Restaurants,"[Mercado de San Antón (C. Augusto Figueroa, 24...",40.421965,-3.697573,0,91164508
1,Aloha Poké,Hawaiian Restaurants,"[Calle de la Libertad 17, 28004 Madrid Madrid,...",40.421135,-3.697380,1,91172363
2,Bagatella,Spanish Restaurants,"[C. Pelayo, 60, 28004 Madrid Madrid, España]",40.424182,-3.697476,2,91163882
3,Bazaar,Mediterranean Restaurants,"[C. Libertad, 21, 28004 Madrid Madrid, España]",40.421290,-3.697393,3,91159509
4,Boho Bar,Restaurants,"[C. Colmenares, 13 (C. San Marcos), 28004 Madr...",40.421190,-3.696840,4,91155204

In [63]:
# Renombro columnas
rest_json.rename(columns={'Restaurant': 'restaurants', 'Address': 'address', 'lomgitude': 'longitude'}, inplace=True)

In [64]:
rest_json_final = rest_json[['restaurantsID','restaurants','address','latitude','longitude', 'telephone']]

rest_json_final.head()

,restaurantsID,restaurants,address,latitude,longitude,telephone
0,0,7 Delicatessen,"[Mercado de San Antón (C. Augusto Figueroa, 24...",40.421965,-3.697573,91164508
1,1,Aloha Poké,"[Calle de la Libertad 17, 28004 Madrid Madrid,...",40.421135,-3.697380,91172363
2,2,Bagatella,"[C. Pelayo, 60, 28004 Madrid Madrid, España]",40.424182,-3.697476,91163882
3,3,Bazaar,"[C. Libertad, 21, 28004 Madrid Madrid, España]",40.421290,-3.697393,91159509
4,4,Boho Bar,"[C. Colmenares, 13 (C. San Marcos), 28004 Madr...",40.421190,-3.696840,91155204

In [65]:
# Convierto el df a json y lo guardo
json_rest =rest_json_final.to_json(orient='records')
parsed = json.loads(json_rest)
with open('json_rest.json', 'w+') as outfile:
    json.dump(parsed, outfile, indent=4)

In [49]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                       'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})

right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                          'key2': ['K0', 'K0', 'K0', 'K0'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [50]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [51]:
result = pd.merge(left, right, on=['key1', 'key2'])
result

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

## Uno los dos dataframe en uno

In [67]:
# Pruebo con merge inner cogiendo la zona comun de los dos df
merged_8 = pd.merge(left=rest_json_final, right=menu_4, left_on='restaurantsID', right_on='restaurantsID')
merged_8

,restaurantsID,restaurants,address,latitude,longitude,telephone,style,name,price,rangeprice,ranking
0,0,7 Delicatessen,"[Mercado de San Antón (C. Augusto Figueroa, 24...",40.421965,-3.697573,91164508,Ensalada,Ensalada de queso de cabra con naranja agria a...,8.5,1,4.1
1,0,7 Delicatessen,"[Mercado de San Antón (C. Augusto Figueroa, 24...",40.421965,-3.697573,91164508,Entrantes,Tortilla de patata con cebolla caramelizada,8.0,1,3.7
2,0,7 Delicatessen,"[Mercado de San Antón (C. Augusto Figueroa, 24...",40.421965,-3.697573,91164508,Ensalada,Ensalada de foie y cebolla caramelizada,8.5,1,4.5
3,0,7 Delicatessen,"[Mercado de San Antón (C. Augusto Figueroa, 24...",40.421965,-3.697573,91164508,Pollo,Pollo yakitori,8.0,1,3.8
4,0,7 Delicatessen,"[Mercado de San Antón (C. Augusto Figueroa, 24...",40.421965,-3.697573,91164508,Pizza,Pizza de gambón y chile confitado,8.5,1,3.1
...,...,...,...,...,...,...,...,...,...,...,...
511,25,tuk tuk,"[C. Barquillo, 24, 28004 Madrid Madrid, España]",40.422550,-3.695610,91165307,Carne,"Ternera al curry con verduras, anacardos, arro...",18.0,3,4.3
512,25,tuk tuk,"[C. Barquillo, 24, 28004 Madrid Madrid, España]",40.422550,-3.695610,91165307,Pescado,Teriyaki de salmón servido con arroz de jazmín...,18.0,3,3.9
513,25,tuk tuk,"[C. Barquillo, 24, 28004 Madrid Madrid, España]",40.422550,-3.695610,91165307,Postres,"Plátano asado, envuelto en azúcar de caña, fru...",6.5,1,3.3
514,25,tuk tuk,"[C. Barquillo, 24, 28004 Madrid Madrid, España]",40.422550,-3.695610,91165307,Postres,Fruta de temporada servida con sorbete de menta,6.5,1,3.6
515,25,tuk tuk,"[C. Barquillo, 24, 28004 Madrid Madrid, España]",40.422550,-3.695610,91165307,Postres,Carpaccio de piña aderezado con menta y sorbet...,6.5,1,4.5

In [68]:
# Modifico la psosición de las columnas
merged_8 = merged_8[['style','name','price','rangeprice','ranking', 'restaurants','restaurantsID','address','latitude','longitude', 'telephone']]
merged_8

,style,name,price,rangeprice,ranking,restaurants,restaurantsID,address,latitude,longitude,telephone
0,Ensalada,Ensalada de queso de cabra con naranja agria a...,8.5,1,4.1,7 Delicatessen,0,"[Mercado de San Antón (C. Augusto Figueroa, 24...",40.421965,-3.697573,91164508
1,Entrantes,Tortilla de patata con cebolla caramelizada,8.0,1,3.7,7 Delicatessen,0,"[Mercado de San Antón (C. Augusto Figueroa, 24...",40.421965,-3.697573,91164508
2,Ensalada,Ensalada de foie y cebolla caramelizada,8.5,1,4.5,7 Delicatessen,0,"[Mercado de San Antón (C. Augusto Figueroa, 24...",40.421965,-3.697573,91164508
3,Pollo,Pollo yakitori,8.0,1,3.8,7 Delicatessen,0,"[Mercado de San Antón (C. Augusto Figueroa, 24...",40.421965,-3.697573,91164508
4,Pizza,Pizza de gambón y chile confitado,8.5,1,3.1,7 Delicatessen,0,"[Mercado de San Antón (C. Augusto Figueroa, 24...",40.421965,-3.697573,91164508
...,...,...,...,...,...,...,...,...,...,...,...
511,Carne,"Ternera al curry con verduras, anacardos, arro...",18.0,3,4.3,tuk tuk,25,"[C. Barquillo, 24, 28004 Madrid Madrid, España]",40.422550,-3.695610,91165307
512,Pescado,Teriyaki de salmón servido con arroz de jazmín...,18.0,3,3.9,tuk tuk,25,"[C. Barquillo, 24, 28004 Madrid Madrid, España]",40.422550,-3.695610,91165307
513,Postres,"Plátano asado, envuelto en azúcar de caña, fru...",6.5,1,3.3,tuk tuk,25,"[C. Barquillo, 24, 28004 Madrid Madrid, España]",40.422550,-3.695610,91165307
514,Postres,Fruta de temporada servida con sorbete de menta,6.5,1,3.6,tuk tuk,25,"[C. Barquillo, 24, 28004 Madrid Madrid, España]",40.422550,-3.695610,91165307
515,Postres,Carpaccio de piña aderezado con menta y sorbet...,6.5,1,4.5,tuk tuk,25,"[C. Barquillo, 24, 28004 Madrid Madrid, España]",40.422550,-3.695610,91165307

In [69]:
# Convierto el df a json y lo guardo
json_unido = merged_8.to_json(orient='records')
parsed = json.loads(json_unido)
with open('json_unido.json', 'w+') as outfile:
    json.dump(parsed, outfile, indent=4)